Ran Plan for 2 projects:

1. project: `stacks-terraform` dir: `stacks/terraform` workspace: `default`
1. project: `stacks-opentofu` dir: `stacks/opentofu` workspace: `default`
---

### 1. project: `stacks-terraform` dir: `stacks/terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.google_project.borghaus: Reading...
data.google_project.borghaus: Read complete after 1s [id=projects/borghaus]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_storage_bucket.terraform-bucket will be created
+ resource "google_storage_bucket" "terraform-bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US-EAST1"
      + name                        = "borghaus-terraform-bucket"
      + project                     = "borghaus"
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p stacks-terraform
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://868322bf184f:4141/lock?id=abborg%252Finfra%252Fstacks%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p stacks-terraform
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. project: `stacks-opentofu` dir: `stacks/opentofu` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.google_project.borghaus: Reading...
data.google_project.borghaus: Read complete after 1s [id=projects/borghaus]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_storage_bucket.opentofu-bucket will be created
+ resource "google_storage_bucket" "opentofu-bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US-EAST1"
      + name                        = "borghaus-opentofou-bucket"
      + project                     = "borghaus"
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p stacks-opentofu
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://868322bf184f:4141/lock?id=abborg%252Finfra%252Fstacks%252Fopentofu%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p stacks-opentofu
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```